pocketbase-stress-test.yml
config:
  target: 'http://127.0.0.1:8090'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 20
      name: "Moderate load"
    - duration: 30
      arrivalRate: 50
      name: "High load"
  http:
    timeout: 30
  processor: ./pocketbase-stress-processor.js

scenarios:
  - name: "PocketBase Health Check"
    weight: 25
    flow:
      - get:
          url: "/api/health"

  - name: "Authentication Flow"
    weight: 25
    flow:
      - post:
          url: "/api/collections/users/auth-with-password"
          json:
            identity: "{{ generateRandomEmail() }}"
            password: "testpassword123"
          capture:
            - json: "$.token"
              as: "authToken"

  - name: "Collections Read"
    weight: 30
    flow:
      - get:
          url: "/api/collections/training_sessions/records"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/collections/training_goals/records"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Data Creation Test"
    weight: 20
    flow:
      - post:
          url: "/api/collections/training_sessions/records"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Test Session {{ generateRandomString() }}"
            duration: 30
            intensity: "moderate"